analogdevicesinc/msdk/Libraries/PeriphDrivers/Include/MAX32690/can.h
/**
 * @brief   Set up CAN device for DMA data receive
 * 
 * @param can_idx   Index of the CAN peripheral to receive data
 * @param req       Pointer to struct that stores CAN message information, initialize "msg_info" to expected configuration of the message to be received (Needed to ensure proper DMA length is set, if these are not known use MXC_CAN_MessageReadAsync instead.) 
 * @param dma_cb    Pointer to DMA callback function.
 * @return  Success/Fail, see \ref MXC_Error_Codes for a list of return codes.
 * 
 * @warning MAX32690 does not support receiving CAN FD messages.
 * @warning The structure pointed to by 'req' must remain unchanged and in scope until the 
 *          RX complete event has been signaled.
 */
int MXC_CAN_MessageReadDMA(uint32_t can_idx, mxc_can_req_t *req, void (*dma_cb)(int, int));

/**
 * @brief   General interrupt handler for MessageSendAsync and MessageReadAsync
 * 
 * @param can_idx   Index of the CAN peripheral to handle interrupts for
 * 
 * @return  Success/Fail, see \ref MXC_Error_Codes for a list of return codes.
 */
int MXC_CAN_Handler(uint32_t can_idx);

/**
 * @brief   Perform control operation on CAN peripheral(s)
 * 
 * @param can_idx   Index of CAN peripheral to perform control function on
 * @param ctrl      Operation to perform on the CAN peripherals
 * @param ctrl_arg  Depends on ctrl. RETRANSMISSION: 1-Enable, 0-Disable; TRANSCEIVER_DELAY: number of time quanta to delay; any other value of control this parameter is ignored
 *
 * @return  Success/Fail, see \ref MXC_Error_Codes for a list of return codes.
 * 
 * @warning MAX32690 does not support CAN FD, passing MXC_CAN_CTRL_SET_FD_MODE will return an error.
 */
int MXC_CAN_Control(uint32_t can_idx, mxc_can_ctrl_t ctrl, uint32_t ctrl_arg);

/**
 * @brief   Configure wakeup timer settings (must be called before entering sleep mode)
 * 
 * @param can_idx           Index of CAN peripheral to configure wakeup timer for
 * @param prescaler         Value to scale the CAN clock by to generate the wakup clock signal
 * @param wup_filter_tm     Value to set Wake-up filter time register to 
 * @param wup_expire_tm     Value to set wake-up expire time register to
 *
 * @return  Success/Fail, see \ref MXC_Error_Codes for a list of return codes.
 */
int MXC_CAN_SetWakeupTimer(uint32_t can_idx, uint8_t prescaler, uint16_t wup_filter_tm,
                           uint32_t wup_expire_tm);

/*
 * @brief   Get status of the bus unit
 *
 * @param can_idx   Index of CAN peripheralto get status of
 *
 * @return  Information about the bus and error status 
 */
mxc_can_stat_t MXC_CAN_GetStatus(uint32_t can_idx);

/**
 * @brief   Notify unit event handler of event that transpired
 * 
 * @param can_idx   Index of CAN peripheral which the event transpired on
 * 
 * @param event     Event that occured
 */
void MXC_CAN_SignalUnitEvent(uint32_t can_idx, mxc_can_unit_evt_t event);

/**
 * @brief   Notify object event handler of event that transpired
 * 
 * @param can_idx   Index of the CAN peripheral which had the event
 * @param event     Event that occured
 */
void MXC_CAN_SignalObjectEvent(uint32_t can_idx, mxc_can_obj_evt_t event);

/**@} end of group can */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_PERIPHDRIVERS_INCLUDE_MAX32690_CAN_H_
